{
  "2025-01-01": "Mary shows us how to welcome Christ into our lives with humility and trust.",
  "2025-01-02": "Basil and Gregory remind us of the power of friendship rooted in faith.",
  "2025-01-03": "Let us honor the Holy Name of Jesus by living lives worthy of His call.",
  "2025-01-04": "St. Elizabeth Ann Seton teaches us the value of education and service to the poor.",
  "2025-01-05": "The Magi’s journey invites us to bring our own gifts to Christ.",
  "2025-01-06": "Brother André shows us how small acts of faith can move mountains.",
  "2025-01-07": "St. Raymond’s dedication to truth encourages us to uphold integrity.",
  "2025-01-08": "Even in ordinary days, Christ is present and working in our hearts.",
  "2025-01-09": "We are called to deepen our prayer during the quiet days of Ordinary Time.",
  "2025-01-10": "Faithfulness in small things prepares us for greater service.",
  "2025-01-11": "The Lord’s light shines even in the hidden days of life.",
  "2025-01-12": "Christ’s baptism reminds us of our identity as beloved children of God.",
  "2025-01-13": "St. Hilary encourages us to defend truth with courage.",
  "2025-01-14": "Ordinary moments are filled with extraordinary grace.",
  "2025-01-15": "Patience and hope sustain us through challenges.",
  "2025-01-16": "Trust in God transforms our daily struggles.",
  "2025-01-17": "St. Anthony’s solitude reminds us to make space for prayer.",
  "2025-01-18": "We walk together as a community of faith, united in Christ.",
  "2025-01-19": "Sundays renew us in the hope of Christ’s resurrection.",
  "2025-01-20": "The martyrs Fabian and Sebastian show us courage under persecution.",
  "2025-01-21": "St. Agnes calls us to purity and unwavering devotion.",
  "2025-01-22": "Today we intercede for the dignity of every human life.",
  "2025-01-23": "Vincent and Marianne inspire us with sacrifice and compassion.",
  "2025-01-24": "St. Francis de Sales teaches us gentleness and patience.",
  "2025-01-25": "Paul’s conversion reminds us no one is beyond God’s mercy.",
  "2025-01-26": "Scripture Sunday reminds us to listen attentively to God’s Word.",
  "2025-01-27": "Angela Merici calls us to nurture others in faith.",
  "2025-01-28": "Thomas Aquinas invites us to seek God with both heart and mind.",
  "2025-01-29": "Ordinary days are opportunities to serve with love.",
  "2025-01-30": "Steadfast faith brings peace amidst uncertainty.",
  "2025-01-31": "Don Bosco inspires us to guide and support the youth."
}
