{
  "2025-01-01": "Mary shows us how to welcome Christ into our lives with humility and trust.",
  "2025-01-02": "Basil & Gregory show that friendship rooted in faith transforms communities.",
  "2025-01-03": "Whisper the Holy Name of Jesus during moments of doubt or fear.",
  "2025-01-04": "Let St. Elizabeth Ann Seton inspire your service with love and endurance.",
  "2025-01-05": "Like the Magi, seek Christ with gifts of heart, mind, and life.",
  "2025-01-06": "Brother André’s quiet devotion challenges us to hidden holiness.",
  "2025-01-07": "Seek mercy and truth in balance, as St. Raymond teaches.",
  "2025-01-08": "Find Christ in everyday routines—He’s present.",
  "2025-01-09": "Invite God into your work and small tasks today.",
  "2025-01-10": "Gratitude transforms dreary tasks into prayers.",
  "2025-01-11": "Silence invites the Lord’s voice into our hearts.",
  "2025-01-12": "Remember your baptism and step forward as God’s beloved child.",
  "2025-01-13": "Let courage and charity guide your speech.",
  "2025-01-14": "Small acts of faithfulness sow seeds of grace.",
  "2025-01-15": "Trust God with your worries by offering them to Him today.",
  "2025-01-16": "Hidden kindness transforms hearts—offer one quietly.",
  "2025-01-17": "Seek solitude to hear God’s voice clearer.",
  "2025-01-18": "We walk in faith together; pray for your community.",
  "2025-01-19": "Let Sunday feed you for the week ahead.",
  "2025-01-20": "The martyrs remind us faith is stronger than fear.",
  "2025-01-21": "Purity is courageous love; seek St. Agnes’s prayers.",
  "2025-01-22": "Offer your voice to defend life with dignity.",
  "2025-01-23": "Speak with patience; let love speak first.",
  "2025-01-24": "Write, teach, serve with a spirit of Francis de Sales.",
  "2025-01-25": "No one is beyond redemption—hold onto hope.",
  "2025-01-26": "Let Scripture shape and heal your heart.",
  "2025-01-27": "Encourage others in faith with gentle words.",
  "2025-01-28": "Let learning deepen love for God and truth.",
  "2025-01-29": "Serve quietly in daily life as a hidden labor of love.",
  "2025-01-30": "Thank God for small gifts and accept small setbacks with grace.",
  "2025-01-31": "Embrace youth with Don Bosco’s heart of tenderness."
}
