{
  "2025-08-01": {
    "history": "St. Alphonsus Liguori (1696–1787), founder of the Redemptorists.",
    "reflection": "Lord, teach me to choose mercy in all things."
  },
  "2025-08-02": {
    "history": "Eusebius defended the Nicene faith; Eymard fostered Eucharistic adoration.",
    "reflection": "Jesus, deepen my love for Your Eucharistic Heart."
  },
  "2025-08-04": {
    "history": "The Curé of Ars renewed parish life through confession and prayer.",
    "reflection": "Grant me fidelity in the small duties that sanctify."
  },
  "2025-08-05": {
    "history": "St. Mary Major is Rome’s oldest Marian church.",
    "reflection": "Mary, lead me to adore your Son with a childlike heart."
  },
  "2025-08-06": {
    "history": "Christ revealed His glory on the holy mountain.",
    "reflection": "Open my ears to Your Word; transfigure my heart."
  },
  "2025-08-08": {
    "history": "Dominic founded the Order of Preachers to proclaim truth with love.",
    "reflection": "Spirit of Truth, guide my words for Your glory."
  },
  "2025-08-10": {
    "history": "Deacon Lawrence served the poor and sealed his witness with martyrdom.",
    "reflection": "Let me see the poor as Your treasure, Lord."
  },
  "2025-08-11": {
    "history": "Clare embraced poverty and contemplation, mirroring Francis.",
    "reflection": "Free my heart from clutter so I may cling to You."
  },
  "2025-08-14": {
    "history": "Kolbe offered his life in Auschwitz for a fellow prisoner.",
    "reflection": "Make my love courageous and sacrificial."
  },
  "2025-08-15": {
    "history": "The Assumption celebrates Mary taken body and soul into glory.",
    "reflection": "Mary, raise my thoughts to the things of heaven."
  },
  "2025-08-20": {
    "history": "Bernard preached Christ with burning charity.",
    "reflection": "Inflame my heart with love for Jesus."
  },
  "2025-08-22": {
    "history": "Mary shares in Christ’s kingship as Queen and Mother.",
    "reflection": "Reign in my thoughts, words, and deeds."
  },
  "2025-08-24": {
    "history": "Bartholomew preached the Gospel; tradition recounts his martyrdom.",
    "reflection": "Give me courage to witness faithfully."
  },
  "2025-08-27": {
    "history": "Monica persevered in prayer for Augustine’s conversion.",
    "reflection": "Strengthen my intercession for loved ones."
  },
  "2025-08-28": {
    "history": "Augustine, Doctor of grace, illumined minds with his writings.",
    "reflection": "Our hearts are restless until they rest in You."
  },
  "2025-08-29": {
    "history": "John the Baptist bore witness to truth unto death.",
    "reflection": "Grant me purity and courage of heart."
  },
  "2025-09-03": {
    "history": "Gregory the Great reformed worship and served the poor.",
    "reflection": "Make me a servant-leader after Your Heart."
  },
  "2025-09-08": {
    "history": "Mary’s birth heralds the dawn of salvation.",
    "reflection": "Let my life proclaim Your goodness like Mary’s."
  },
  "2025-09-12": {
    "history": "The Holy Name of Mary is a sign of trust and love.",
    "reflection": "Mary, be near me in trial."
  },
  "2025-09-13": {
    "history": "Chrysostom, golden-mouthed preacher, taught bold charity and truth.",
    "reflection": "Sanctify my speech, Lord, to heal and enlighten."
  },
  "2025-09-14": {
    "history": "The Cross is the sign of victory and life.",
    "reflection": "We adore You, O Christ, and we bless You."
  },
  "2025-09-15": {
    "history": "Mary shares intimately in her Son’s Passion.",
    "reflection": "Mother of Sorrows, keep me faithful beneath the Cross."
  },
  "2025-09-16": {
    "history": "Cornelius and Cyprian shepherded the Church in persecution.",
    "reflection": "Unite my heart to the suffering Body of Christ."
  },
  "2025-09-17": {
    "history": "Robert Bellarmine served truth with learning and humility.",
    "reflection": "Join knowledge with charity in me, Lord."
  },
  "2025-09-20": {
    "history": "Korean Martyrs witnessed to Christ with heroic faith.",
    "reflection": "Strengthen persecuted Christians and my own faith."
  },
  "2025-09-21": {
    "history": "Matthew answered Jesus’ call and became Evangelist.",
    "reflection": "Make me swift to rise and follow You."
  },
  "2025-09-23": {
    "history": "Padre Pio ministered reconciliation and healing.",
    "reflection": "Make me an instrument of Your mercy."
  },
  "2025-09-26": {
    "history": "Cosmas and Damian served as physician-martyrs.",
    "reflection": "Teach me to serve without counting the cost."
  },
  "2025-09-27": {
    "history": "Vincent de Paul organized effective charity for the poor.",
    "reflection": "Let my love be practical and joyful."
  },
  "2025-09-29": {
    "history": "Archangels Michael, Gabriel, Raphael: defender, messenger, healer.",
    "reflection": "Guard, guide, and heal me according to God’s will."
  }
}